<?php declare(strict_types=1);
return [
    [
        'name' => 'Математический анализ'
    ],
    [
        'name' => 'Геометрия и алгебра'
    ],
    [
        'name' => 'Дифференциальные уравнения'
    ],
    [
        'name' => 'Теория вероятностей и математическая статистика'
    ],
    [
        'name' => 'Иностранный язык'
    ],
    [
        'name' => 'Дискретная математика и математическая логика'
    ],
    [
        'name' => 'Вычислительные методы алгебры'
    ],
    [
        'name' => 'Операционные системы'
    ],
    [
        'name' => 'Функциональный анализ и интегральные уравнения'
    ],
    [
        'name' => 'Алгоритмы и структуры данных'
    ],
    [
        'name' => 'Методы численного анализа'
    ],
    [
        'name' => 'Методы оптимизации'
    ],
    [
        'name' => 'Уравнения математической физики'
    ],
    [
        'name' => 'Компьютерные сети'
    ],
    [
        'name' => 'Методы промышленного программирования'
    ],
    [
        'name' => 'Web-программирование'
    ],
    [
        'name' => 'Избранные главы информатики'
    ],
    [
        'name' => 'Исследование операций'
    ],
    [
        'name' => 'Численные методы математической физики'
    ],
    [
        'name' => 'Модели данных и системы управления базами данных'
    ],
    [
        'name' => 'Программирование'
    ],
];
