<?php
use domain\workReport\WorkReportLevel;

return [
    [
		'description' => 'Организация и проведение конкурса «Национальное гостеприимство» (расп. №56 от 05.02.2020);', 
		'level' => WorkReportLevel::BREST, 
		'teacher_id' => 1, 
		'type_id' => 5,
	],
    [
		'description' => 'Организация факультетского матча по мини-футболу между командой студентов 1 курса и командой старшекурсников физико-математического факультета; по баскетболу между командой преподавателей и студентов 30.10.2020 в 20.30 в спортивном зале Сендер А.Н. (расп. 223 от 08.10.2020);', 
		'level' => WorkReportLevel::BREST, 
		'teacher_id' => 1, 
		'type_id' => 6,
	],
    [
		'description' => 'Организация и проведение информационного часа «Спортивная жизнь РБ. Достижения 2020 года»;', 
		'level' => WorkReportLevel::BREST, 
		'teacher_id' => 1, 
		'type_id' => 5,
	],
];
