<?php declare(strict_types=1);
return [
    [
        'name' => 'Естествознания'
    ],
    [
        'name' => 'Филологический'
    ],
    [
        'name' => 'Юридический'
    ],
    [
        'name' => 'Исторический'
    ],
    [
        'name' => 'Физико-математический'
    ],
    [
        'name' => 'Иностранных языков'
    ],
    [
        'name' => 'Физического воспитания и туризма'
    ],
    [
        'name' => 'Психолого-педагогический'
    ],
    [
        'name' => 'Социально-педагогический'
    ],
];
