<?php declare(strict_types=1);
use domain\workReport\WorkReportLevel;

return [
    [
        'description' => 'Математический анализ (2014): учеб. пособие: в 4 ч. / Н.П. Семенчук, Н.Н. Сендер, С.А. Марзан, А. Н. Сендер, под общ. ред. Н.Н. Сендера ; Брест. гос. ун-т им. А. С. Пушкина. – Брест: БрГУ, 2020. – Ч. 3: Дифференциальное и интегральное исчисление функций многих переменных: в 2 кн. – кн. 1. – 226 с. (гриф Министерства образования Республики Беларусь)', 
        'level' => WorkReportLevel::BREST, 
        'type_id' => 1,
    ],
    [
        'description' => 'Математический анализ: учеб. пособие: в 4 ч. / Н.П. Семенчук, Н.Н. Сендер, С.А. Марзан, А.Н. Сендер, под общ. ред. Н.Н. Сендера ; Брест. гос. ун-т им. А. С. Пушкина. – Брест: БрГУ, 2020. – Ч. 3: Дифференциальное и интегральное исчисление функций многих переменных: в 2 кн. – кн. 2. – 166 с. (гриф Министерства образования Республики Беларусь)', 
        'level' => WorkReportLevel::BREST, 
        'type_id' => 2,
    ],
];
