<?php declare(strict_types=1);
use domain\workReport\WorkReportLevel;

return [
    [
        'description' => 'Сендер, А.Н. Карточка товара в системе управления товарами интернет-магазина / А.Н. Сендер, К.А. Гольчук // Математическое моделирование и новые образовательные технологии в математике: сб. тезисов. Респ. науч.-практ. конф., Брест, 23–24 апр. 2020 г. / Брест. гос. ун-т им. А.С. Пушкина; под общ. ред. А.И. Басика. – Брест: БрГУ, 2020. – С. 3.', 
        'level' => WorkReportLevel::BREST, 
        'type_id' => 1,
    ],
    [
        'description' => 'Сендер, А.Н. Объектно-ориентированное программирование в PHP / Е.К. Пархоц, А.Н. Сендер // Математическое моделирование и новые образовательные технологии в математике: сб. тезисов. Респ. науч.-практ. конф., Брест, 23–24 апр. 2020 г. / Брест. гос. ун-т им. А. С. Пушкина; под общ. ред. А. И. Басика. – Брест: БрГУ, 2020. – С. 4.', 
        'level' => WorkReportLevel::BREST, 
        'type_id' => 2,
    ],
];
