<?php declare(strict_types=1);
return [
    [
        'name' => 'Физика и математика (преподаватель)'
    ],
    [
        'name' => 'Математика и информатика (преподаватель)'
    ],
    [
        'name' => 'Прикладная математика'
    ],
    [
        'name' => 'Экономическая кибернетика'
    ],
    [
        'name' => 'Компьютерная физика'
    ],
    [
        'name' => 'Физика (магистр)'
    ],
    [
        'name' => 'Математика и компьютерные науки с профилизацией "Web-программирование и интернет-технологии" (магистр)'
    ],
];
